# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'teleport'
brew 'fastlane'
brew 'cocoapods'

# Development
brew 'php'
brew 'php@8.0'
brew 'composer'
brew 'imagemagick'

# Apps
cask 'docker'
cask 'figma'
cask 'github'
cask 'google-chrome'
cask 'slack'
cask 'visual-studio-code'
cask 'zoom'
cask 'nextcloud'
cask 'onyx'
cask 'orion'
cask 'setapp'
cask 'warp'



# Mac App Store
mas 'Bitwarden', id: 1352778147
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Spark', id: 1176895641
mas 'Velja', id: 1607635845
mas 'Mactracker', id: 430255202
mas 'MQTT Explorer', id: 1455214828
mas 'Pixelmator Pro', id: 1289583905
mas 'Wireguard', id: 1451685025
mas 'Color Picker', id: 1070506898
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Trello', id: 1278508951
mas 'iMovie', id: 408981434
mas 'Pages', id: 409201541
mas 'Xcode', id: 497799835
mas 'Cardhop', id: 1290358394
mas 'Fantastical', id: 975937182
